tianxiaogua/Home-management-platform-and-home-robot/1-raspi-robot/1-stm32RCT6-Driver/2-keil5-file/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_0_Pin GPIO_PIN_13
#define LED_0_GPIO_Port GPIOC
#define set_motor1_TIM_Pin GPIO_PIN_0
#define set_motor1_TIM_GPIO_Port GPIOA
#define set_motor1_B_Pin GPIO_PIN_1
#define set_motor1_B_GPIO_Port GPIOA
#define set_motor2_TIM_Pin GPIO_PIN_2
#define set_motor2_TIM_GPIO_Port GPIOA
#define set_motor2_B_Pin GPIO_PIN_3
#define set_motor2_B_GPIO_Port GPIOA
#define BAT_Velogy_Pin GPIO_PIN_4
#define BAT_Velogy_GPIO_Port GPIOA
#define OLED_SCL_Pin GPIO_PIN_5
#define OLED_SCL_GPIO_Port GPIOA
#define OLED_DC_Pin GPIO_PIN_6
#define OLED_DC_GPIO_Port GPIOA
#define OLED_SDA_Pin GPIO_PIN_7
#define OLED_SDA_GPIO_Port GPIOA
#define OLED_RES_Pin GPIO_PIN_4
#define OLED_RES_GPIO_Port GPIOC
#define OLED_CS_Pin GPIO_PIN_5
#define OLED_CS_GPIO_Port GPIOC
#define OLED_BLK_Pin GPIO_PIN_0
#define OLED_BLK_GPIO_Port GPIOB
#define PWM_SCL_Pin GPIO_PIN_6
#define PWM_SCL_GPIO_Port GPIOB
#define PWM_SDA_Pin GPIO_PIN_7
#define PWM_SDA_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
